#Дано число n<1440. С начала суток прошло n минут. Определите, сколько часов и минут будут показывать электронные часы в этот момент. Программа должна вывести два числа: количество часов (от 0 до 23) и количество минут (от 0 до 59).

a = None
b = 5
c = 3.9
print(type (a))
float(b)
print(float(b))
print(int(c))
d = True
print(type(d))
