'''Переменная(variable) это участок памяти, в котором можно хранить какие-либо данные. Перменная характеризуется типом названием и значением
то есть у каждой переменной есть
Математические'''

#+, -, /, *, **, %, // (деление без остатка)
# Приоритет операции сначала скобки, деление/умножение, и далее сложение/вычетания

#Это всё разные типы данных.
#типы данных в языке питон: None - неопределенный тип данных, integer целочисленный тип данных, float это с плавающшей заяптой \
#list список
#логические перменные boolean
#string строка
#dict словарь
#set множества
#картежи tuple неизменяймый список

#n школьников делят k яблок поровну, неделящийся остаток остается в корзинке. Сколько яблок достанется каждому школьнику? Сколько яблок останется в корзинке? Программа получает на вход числа n и k и должна вывести искомое количество яблок (два числа).
#n школьников делят k яблок поровну, неделящийся остаток остается в корзинке. Сколько яблок достанется каждому школьнику? Сколько яблок останется в корзинке? Программа получает на вход числа n и k и должна вывести искомое количество яблок (два числа).